modules/Tour/Controllers/TourController.php

        if (empty(setting_item('space_location_search_style')) or setting_item('space_location_search_style') == 'normal') {
            $limit_location = 1000;
        }
        $data = [
            'rows' => $list,
            'tour_category' => $this->tourCategoryClass::where('status', 'publish')->with(['translation'])->get()->toTree(),
            'tour_location' => $this->locationClass::where('status', 'publish')->with(['translation'])->limit($limit_location)->get()->toTree(),
            'tour_min_max_price' => $this->tourClass::getMinMaxPrice(),
            'markers' => $markers,
            'blank' => setting_item('search_open_tab') == 'current_tab' ? 0 : 1,
            'seo_meta' => $this->tourClass::getSeoMetaForPageList(),
        ];
---
select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null