modules/User/Traits/HasRoles.php

    public function assignRole($role_id)
    {
        if ($role_id instanceof Role) {
            $this->role_id = $role_id->id;
            $this->save();
        }

        $role = Role::find((int) $role_id);
---
select * from `core_roles` where `core_roles`.`id` = 1 limit 1