modules/Page/Admin/PageController.php

    public function index(Request $request)
    {
        $this->checkPermission('page_view');
        $page_name = $request->query('page_name');
        $datapage = new Page;
        if ($page_name) {
            $datapage = Page::where('title', 'LIKE', '%'.$page_name.'%');
        }
        $datapage = $datapage->orderBy('title', 'asc');
        $data = [
            'rows' => $datapage->paginate(20),
            'page_title' => __('Page Management'),
            'breadcrumbs' => [
                [
                    'name' => __('Pages'),
                    'url' => route('page.admin.index'),
                ],
                [
                    'name' => __('All'),
                    'class' => 'active',
                ],
            ],
        ];
---
select * from `core_pages` where `core_pages`.`deleted_at` is null order by `title` asc limit 20 offset 0
select count(*) as aggregate from `core_pages` where `core_pages`.`deleted_at` is null

    public function toBuilder($id)
    {
        $row = Page::find($id);
---
select * from `core_pages` where `core_pages`.`id` = '8' and `core_pages`.`deleted_at` is null limit 1