modules/Tour/Admin/CategoryController.php

    public function getForSelect2(Request $request)
    {
        $pre_selected = $request->query('pre_selected');
        $selected = $request->query('selected');

        if ($pre_selected && $selected) {
            $item = $this->tourCategoryClass::find($selected);
            if (empty($item)) {
                return response()->json([
                    'text' => '',
                ]);
            } else {
                return response()->json([
                    'text' => $item->name,
                ]);
            }
        }
        $q = $request->query('q');
        $query = $this->tourCategoryClass::select('id', 'name as text')->where('status', 'publish');
        if ($q) {
            $query->where('name', 'like', '%'.$q.'%');
        }
        $res = $query->orderBy('id', 'desc')->limit(20)->get();
---
select `id`, `name` as `text` from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null order by `id` desc limit 20