app/Helpers/AppHelper.php

select * from `core_pages` where `core_pages`.`id` = '' and `core_pages`.`deleted_at` is null limit 1
---
function get_page_url($page_id)
{
    $page = \Modules\Page\Models\Page::find($page_id);