modules/Template/Admin/TemplateController.php

select * from `core_templates` where `core_templates`.`id` = '7' limit 1
---
    public function edit(Request $request, $id)
    {
        $this->checkPermission('template_update');
        $row = $this->templateClass::find($id);

select * from `core_templates` where `core_templates`.`id` = '7' limit 1
---
    public function store(Request $request)
    {
        if (is_demo_mode()) {
            return $this->sendError('DEMO MODE: Can not edit template');
        }
        $request->validate([
            'content' => 'required',
            'title' => 'required|max:255',
        ]);
        if ($request->input('id')) {
            $this->checkPermission('template_update');
            $template = $this->templateClass::find($request->input('id'));