app/Http/Controllers/HomeController.php

    public function index()
    {
        $home_page_id = setting_item('home_page_id');
        if ($home_page_id && $page = Page::where('id', $home_page_id)->where('status', 'publish')->first()) {
---
select * from `core_pages` where `id` = '8' and `status` = 'publish' and `core_pages`.`deleted_at` is null limit 1