modules/Tour/Blocks/BoxCategoryTour.php

select * from `bravo_tour_category` where `id` in ('4', '3', '2', '1', '2') and `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null
---
    public function content($model = [])
    {
        if (! empty($model['list_item'])) {
            $ids = collect($model['list_item'])->pluck('category_id');
            $categories = TourCategory::query()->whereIn('id', $ids)->where('status', 'publish')->get();